Repository: celerini/website
Catalog: start/1.18/po/*.po
Languages: ja, uk, zh_tw

source: en
ja: ja
uk: uk
zh_tw: zh_TW

source: The Battle for Wesnoth 1.18
zh_tw: 韋諾之戰 1.18

source: <span id="branding-sub">Draconic Invasions Update</span>
uk: <span id="branding-sub">Оновлення Драконічних Вторгнень</span>
zh_tw: <span id="branding-sub">龍族入侵更新</span>

source: <i>March 2024.</i> The development team is proud to present version 1.18 of <cite><a href="/">The&nbsp;Battle&nbsp;for&nbsp;Wesnoth</a></cite>!
ja: <i>2024年3月、</i>開発チームは<cite><a href="/">The&nbsp;Battle&nbsp;for&nbsp;Wesnoth</a></cite>バージョン1.18を自信を持ってお届けします！
uk: <i>Березень 2024.</i> Команда розробників рада презентувати версію 1.18 для <cite><a href="/">The&nbsp;Battle&nbsp;for&nbsp;Wesnoth</a></cite>!
zh_tw: <i>2024 年 3 月</i>開發團隊在此隆重推出 1.18 版本的<cite><a href="/">韋諾之戰</a></cite>!

source: This release features many new additions as well as refinements to existing content including a new Drake campaign, a full remake of our oldest Loyalist campaign, greatly improved graphical performance, major balance changes for multiplayer, achievements, many enhancements to the editor, and so much more! Try them out for yourself, or take a look <a href="#game">below</a> for more details.
ja: このリリースには多くの改善と新機能が施されました。新しいドレークのキャンペーン、最古の忠誠軍のキャンペーンのフルリメイク、グラフィックパフォーマンスの大幅な向上、マルチプレイヤーのバランス調整、実績（Achievements）、エディタの数多くの機能強化だけでなく、その他にもたくさんの変更点があります！新機能を直に体験してもよいですし、以下の<a href="#game">詳細</a>をご覧になるのもよいでしょう。
uk: У цьому випуску доволі багато нововведень, як і переробки існуючого змісту, включаючи нову кампанію за Дрейків, повне переосмислення нашої найстарішої кампанії за Вірнопідданих, значно покращену графічну продуктивність, великі зміни балансу для мультиплеєру, багато покращень в редакторі і ще безліч усього! Випробуйте це все самі або <a href="#game">читайте далі</a>, щоб дізнатися більше деталей.
zh_tw: 此版本增加許多新的內容，並對現有的內容進行改善，包括新的龍族戰役、最古老親皇派戰役的全面重製、圖形效能的大幅改善，還有針對多人遊戲的平衡調整、成就系統、編輯器擴充，以及其他更多內容！等您親自來體驗，透過<a href="#game">下方</a>內容來查看更多細節。

source: <a class="download-button" role="button" href="https://www.wesnoth.org/#download"> <span class="download-arrow" aria-hidden="true"></span> <span class="download-text"> <span class="download-big">Download Now</span> </span> </a> <a class="itchio-button" role="button" href="https://wesnoth.itch.io/battle-for-wesnoth" aria-label="Available on itch.io"> <span class="download-text">
uk: <a class="download-button" role="button" href="https://www.wesnoth.org/#download"> <span class="download-arrow" aria-hidden="true"></span> <span class="download-text"> <span class="download-big">Завантажити Зараз</span> </span> </a> <a class="itchio-button" role="button" href="https://wesnoth.itch.io/battle-for-wesnoth" aria-label="Available on itch.io"> <span class="download-text">
zh_tw: <a class="download-button" role="button" href="https://www.wesnoth.org/#download"> <span class="download-arrow" aria-hidden="true"></span> <span class="download-text"> <span class="download-big">立即下載</span> </span> </a> <a class="itchio-button" role="button" href="https://wesnoth.itch.io/battle-for-wesnoth" aria-label="Available on itch.io"> <span class="download-text">

source: <span class="download-big">Get on itch.io</span> </span> </a> <a class="steam-button" role="button" href="https://store.steampowered.com/app/599390"> <span class="download-text"> <span class="steam-icon" aria-hidden="true"></span> <span class="download-big">Get on Steam</span> </span> </a>
uk: <span class="download-big">Отримати на itch.io</span> </span> </a> <a class="steam-button" role="button" href="https://store.steampowered.com/app/599390"> <span class="download-text"> <span class="steam-icon" aria-hidden="true"></span> <span class="download-big">Отримати в Steam</span> </span> </a>
zh_tw: <span class="download-big">在itch.io中下載</span> </span> </a> <a class="steam-button" role="button" href="https://store.steampowered.com/app/599390"> <span class="download-text"> <span class="steam-icon" aria-hidden="true"></span> <span class="download-big">在Steam中下載</span> </span> </a>

source: What’s New in This Update
ja: 本アップデートでの変更点
uk: Що нового в цьому оновленні
zh_tw: 本次更新內容

source: For Players
ja: プレイヤー向け
uk: Для гравців
zh_tw: 針對玩家的更新

source: Wesnoth’s rendering has been completely overhauled, leading to a significant improvement in performance with our own tests showing a nearly 60% boost in FPS. This will of course vary depending on the computer you’re using to run Wesnoth, but will in all cases result in a much smoother and more consistent experience across all areas of the game.
ja: Wesnothのレンダリングを完璧にオーバーホールしたことによってパフォーマンスが大幅に向上し、私達の行ったテストでは60%近いFPSの向上が確認されました。もちろんあなたがWesnothを遊ぶコンピューター次第で差はありますが、どのようなマシンであってもよりスムーズで安定した体験をゲームのあらゆる領域で味わうことができるでしょう。
uk: Рендеринг Весноту було повністю перероблено, що призвело до значного покращення в продуктивності, показуючи приблизно на 60% більше FPS, ніж раніше. Це, звісно, дуже залежить від комп'ютера, який ви використовуєте для гри в Веснот, але в будь-якому разі ви отримаєте більш плавний та цільний досвід на будь-якому етапі гри.
zh_tw: 韋諾之戰的程式渲染已全面改造，性能大幅提升，根據我們的測試，每秒傳輸幀數提升將近 60%。這個表現取決您的電腦性能，但無論如何都會使遊戲在各個領域的體驗更完整和更加一致。

source: All factions in the Default era have gone through major updates to ensure standard 1v1 games are more balanced and to allow campaigns to use the new variable recall cost mechanic. Higher level units have also had a variety of adjustments to better balance the Age of Heroes era as well as survival scenarios where high level units are common. Level three advancements for the Saurian Oracle and Saurian Soothsayer have been added and the Orcish Nightblade now serves as the default advancement for the Orcish Slayer.
ja: 標準の時代のすべての党派に、1対1のゲームのバランスがより良くなるように重要な変更が加えられました。また、召還コストの仕組みに関する新しい変数をキャンペーンで使用できるようになりました。英雄の時代や一部のサバイバルシナリオのバランスを良くするため、高レベルのユニットには多様な調整が加えられました。トカゲの神官とトカゲの僧侶にはレベル3が用意され、オークの夜刀はオークの殺戮者のデフォルトのレベルアップ先となりました。
uk: Усі фракції Типової ери було оновлено, щоб забезпечити більш збалансовані стандартні матчі 1v1, а також щоб дозволити кампаніями використовувати нові різноманітні механіки заклику. Бійці більш високих рівнів також отримали кілька правок, щоб краще збалансувати еру Вік героїв, як і сценарії на виживання, де бійці високих рівнів зустрічаються частіше. Було додано просування третього рівня для Оракула та Ворожбита, а Оркський душогуб тепер є типовим просуванням для Оркського згубника.
zh_tw: 預設時代的所有派系都經歷重大更新，以確保一對一時更加平衡，並確保戰役使用新的可變召喚成本機制。高級單位也進行各種調整，更好地平衡了英雄時代以及高級單位普遍存在的生存章節。已新增蜥蜴先知和蜥蜴預言者的第三階段升級，而且半獸人獵殺者將可升級成半獸人夜刃。

source: Campaigns
ja: キャンペーン
uk: Кампанії
zh_tw: 戰役

source: Campaigns menu screenshot
ja: キャンペーンメニューのスクリーンショット
uk: Зображення меню вибору кампаній
zh_tw: 戰役選單截圖

source: A new campaign, <cite>Winds of Fate</cite>, has been added to the game! This is the first Drake campaign to be included in Wesnoth, showing their fight for survival and tumultuous return to Wesnoth’s Great Continent as they flee their sinking island homes.
ja: 新たなキャンペーン<cite>「運命の風」</cite>が追加されました！ Wesnoth 公式としては初のドレーク・キャンペーンで、彼らの生き残りをかけた戦いと、沈みゆく島から逃れて Wesnoth の大陸へと帰還する波乱の旅路を描きます。
uk: Було додано нову кампанію, <cite>Крила Долі</cite>! Це перша кампанія за дрейків, що була офіційно додана до Весноту, у ній розповідається про їхню боротьбу за виживання та галасливе повернення до Великого Континенту Весноту, після того як їм довелося покинути свою домівку на зникаючому острові.
zh_tw: 此次新增一個新戰役<cite>《命運之風》</cite>！首次在韋諾之戰裡加入龍族戰役，展現他們為生存而戰，逃離沉沒的島嶼家園後重返韋諾大陸的動盪歷程。

source: <cite>Eastern Invasion</cite> — the first Loyalist campaign ever added to Wesnoth — has been fully remade with far deeper characters and greater scenario variety augmented by much more dynamic AI opponents. Several lore conflicts with other campaigns have also been resolved.
ja: <cite>東部侵略</cite>はWesnothに初めて追加された忠誠軍のキャンペーンですが、フルリメイクされました。キャラクターたちはより掘り下げられ、とてもダイナミックな敵AIによってシナリオの多様性が高まりました。また、他のキャンペーンとの間にあったいくつかの歴史の食い違いも解消されました。
uk: <cite>Вторгення зі Сходу</cite> — першу кампанію за Вірнопідданих, коли-небудь додану до Весноту — було повністю перероблено, тепер вона має набагато глибших персонажів та більше різноманіття сценаріїв з динамічними ворогами, що керуються штучним інтелектом. Також було було вирішено декілька конфліктів історії з іншими кампаніями.
zh_tw: <cite>《東部入侵》</cite> — 在韋諾之戰裡首次加入的親皇派戰役 — 目前已經全面重新製作，角色更加深入，情節更加豐富，並且搭配更加動態的人工智慧對手，增加了更多的章節變化。同時也解決了與其他戰役之間的一些故事衝突。

source: And lastly, the Quenoth faction in the campaign <cite>Under the Burning Suns</cite> has been given an overhaul to make them more interesting — hero units can now gain unique bonuses when leveling up while regular units have new abilities and new weapon effects for their attacks, making this a unique experience among Wesnoth’s campaigns.
ja: 最後に、<cite>燃える太陽の下で</cite>のQuenoth党派はより興味深くなるようにオーバーホールされました。レベルアップの際、一般的なユニットでは新しい能力や攻撃時の特殊能力が追加されますが、Quenothのヒーローユニットたちは固有のボーナスを得るようになりました。これによって、Wesnothのキャンペーンの中でも独特な体験をすることができます。
uk: І нарешті, фракцію Квенот з кампанії <cite>Під Жагучими Світилами</cite> було трохи переосмислено, щоб зробити її цікавішою — бійці-герої тепер можуть отримувати унікальні бонуси за підвищення рівня, а звичайні бійці мають нові здібності і ефекти зброї для їхніх атак, роблячи проходження найбільш унікальними досвідом серед усіх кампаній Весноту.
zh_tw: 最後，在<cite>《烈日當空》</cite> 戰役中的昆諾種族已經進行了大幅度的改版，故事更加有趣 — 英雄單位升級時可以獲得獨特的獎勵，而普通單位能在升級時擁有新技能和攻擊時的新武器效果，這將成為韋諾之戰裡戰役中獨一無二的體驗。

source: Multiplayer
ja: マルチプレイヤー
uk: Мультиплеєр
zh_tw: 多人遊戲

source: In-game game history viewer
ja: ゲーム履歴ビューワー
uk: Перегляд історії матчів у грі
zh_tw: 遊戲歷史紀錄

source: Players can now view a history of their own previously played games and can search the history of other players as well by clicking the Match History button in the online multiplayer lobby. This shows information on the game itself, the players in the game, the era used, any modifications enabled, and lets you download the game’s replay to watch for yourself. Additionally, there’s an <a href="https://replays.wesnoth.org/dashboard/">online dashboard</a> available with more general data about games played.
ja: 自身がプレイしたゲーム履歴の閲覧や他のプレイヤーの履歴検索を、オンラインマルチプレイヤーロビーの「マッチ履歴」ボタンをクリックして行えるようになりました。履歴ではそのゲーム自身や参加プレイヤー、使用された時代、有効なModの情報が表示され、ゲームのリプレイをダウンロードして見ることもできます。さらに、<a href="https://replays.wesnoth.org/dashboard/">オンラインダッシュボード</a>ではゲームプレイに関するより総合的なデータを利用できます。
uk: Гравці тепер мають можливість переглядати свої попередні матчі та шукати історію інших гравців, натиснувши кнопку "Історія матчів", знаходячись на мультиплеєрному сервері. Це покаже інформацію про саму гру, гравців у грі, обрану еру, використані модифікації та дозволить завантажити повтор гри для перегляду. Крім того, є <a href="https://replays.wesnoth.org/dashboard/">онлайн дошка</a> з більш загальною інформацією про зіграні ігри.
zh_tw: 現在玩家可以查看自己先前的遊戲歷史紀錄，也可以點選線上多人遊戲大廳中的「對戰歷史」來搜索其他玩家的遊戲歷史紀錄。歷史紀錄會顯示有關遊戲本身、遊戲中的玩家、使用的時代、啟用的任何修改，並讓您下載遊戲的重播來觀看。此外，還能點選<a href="https://replays.wesnoth.org/dashboard/">線上戰情室</a>來查看更多細節。

source: Animated waterfall
ja: 滝のアニメーション
uk: Анімований водоспад
zh_tw: 動畫瀑布

source: A clear separation has been made for auto-hosted games such as Afterlife vs custom games hosted by other players. Games hosted by players will be in the General Lobby tab, while auto-hosted games will be in the Matchmaking tab. To aid with reporting problematic players or games, the <code>/report</code> command now shows a dialog where information about the issue can be entered. And to better handle server disconnects due to network issues, Wesnoth will now automatically detect when your connection is lost and alert you to the problem.
ja: Afterlifeのようなホストが自動で行われるゲームと、他のプレイヤーがホストするカスタムゲームとを明白に区別するようになりました。プレイヤーがホストするゲームは「一般ロビー」タブに、自動ホストされるゲームは「マッチメイキング」タブに表示されます。問題のあるプレイヤーやゲームの通報を支援するために、<code>/report</code>コマンドではダイアログが表示され、問題に関する情報を入力できるようになりました。さらにネットワークの問題によるサーバーからの切断の取り扱いを改善するために、あなたの接続が失われたことをWesnothが自動で検知し、アラートをあなたに表示するようになりました。
uk: Було явно відмежовано матчі, що створюються ботами(такі як Afterlife), від звичайних користувацьких. Ігри, що створюються гравцями, знаходитимуться у вкладці "Головне лобі", а ті, що створюються ботами — у вкладці "Матчмейкінг". Щоб допомогти легше скаржитися на проблемних гравців чи гри, команда <code>/report</code> тепер показує діалогове вікно, де можна ввести інформацію про проблему. І для кращої обробки відключень від сервера через мережеві проблеми, Веснот тепер автоматично виявлятиме, коли втрачено з'єднання і попереджатиме вас про це.
zh_tw: 現在，自動進行的遊戲（例如 Afterlife）與其他玩家主持的自訂遊戲已被區分開來。玩家主持的遊戲將顯示在「一般大廳」中，而自動進行的遊戲則會顯示在「配對」中。為了幫助玩家回報其他有問題的玩家或是遊戲本身的問題，在<code>/report</code>中有一個對話框，玩家可以在對話框內輸入發現的問題。此外，為了能在網路出問題而導致伺服器斷線時做出更好的應對措施，韋諾之戰現在會自動檢測您的連線是否中斷，並主動告知您此訊息。

source: The King of the Hill map has been updated to encourage players to claim the center keep — whichever side holds the hill gains significant bonus income and the first player to take control will obtain a treasure chest containing a tidy sum.
ja: 「丘の王」マップがアップデートされ、中央の主塔を占領するプレイヤーを支援するようになりました。中央の丘を保持した陣営には収入に大きなボーナスが付与され、最初に占領したプレイヤーには大金の入った宝箱が与えられます。
uk: Мапу "Цар Гори" було оновлено, щоб заохотити гравців захоплювати центральну цитадель — сторона, що утримує гору, отримує значний бонусний дохід і перший гравець, що добереться туди, отримає скриню зі скарбами, в якій знаходиться невеликий статок.
zh_tw: 為鼓勵玩家佔領中央要塞，山丘之王地圖已經更新為：無論玩家佔領山頂的哪一方，都能獲得可觀的額外收入，而且第一個佔領者還可獲得一個鉅額寶箱。

source: And, as a cherry on top, the waterfall on Isar’s Cross is now animated.
ja: また、上を見ていただければわかるかと思いますが、「Isar の十字」の滝にアニメーションが付きました。
uk: І на кінець, водоспад на мапі "Перехрестя Ісара" тепер анімований.
zh_tw: 最後作為一個驚喜，伊薩爾交叉口上的瀑布現在已經加入了動畫效果。

source: For Content Creators
ja: コンテンツクリエイター向け
uk: Для творців
zh_tw: 針對創作者們的更新

source: Achievements
ja: 実績
uk: Досягнення
zh_tw: 成就

source: Wesnoth now has built-in support for achievements! These achievements <b>are not Steam achievements</b>, however because of that they are not limited to a predefined set of achievements available only to the base game — add-ons can define their own achievements and can even add additional achievements to other add-ons or to mainline. For this initial version, achievements are already implemented for the tutorial campaign, <cite>Descent into Darkness</cite>, <cite>Eastern Invasion</cite>, <cite>Liberty</cite>, and the co-op multiplayer maps <cite>Dark Forecast</cite>, <cite>Isle of Mists</cite>, <cite>A New Land</cite> and <cite>Team Survival</cite>.
ja: Wesnothに「実績（Achievements）」機能が搭載されました！これは<b>Steamの実績ではありません</b>。それ故にWesnoth標準で定義された実績に限定されておらず、アドオンにそれ自身の実績を同梱したり、Wesnoth標準のコンテンツに対する実績をアドオンから追加することもできます。今回リリースされる最初の実績には、キャンペーンではチュートリアルや<cite>闇へ堕ちて</cite>、<cite>東部侵略</cite>、<cite>自由</cite>に実装されており、協力プレイのマルチプレイヤーマップでは<cite>暗黒の前兆</cite>や<cite>霧の島</cite>、<cite>新天地</cite>、<cite>チームサバイバル</cite>に実装されています。
uk: Веснот тепер підтримує досягнення! Ці досягнення <b>не є досягненнями у Steam</b>, але саме через це вони не обмежені заздалегідь визначеним набором досягнень, доступним у основній грі — аддони/моди можуть створювати свої власні досягнення і навіть можуть додавати додаткові досягнення до інших аддонів чи навіть основної гри. У цій початковій версії досягнення вже було включено для наступного вмісту — Навчання, <cite>Падіння в Темряву</cite>, <cite>Вторгнення зі Сходу</cite>, <cite>Воля</cite>, та кооперативних багатокористувацьких мап <cite>Неясний прогноз</cite>, <cite>Острів Імли</cite>, <cite>Нова Земля</cite> та <cite>Командне виживання</cite>.
zh_tw: 韋諾之戰現在支援內建成就系統！這些成就<b>並非 Steam 成就</b>，也因此並不限於基本遊戲中預定的成就集 — 模組可以定義自己的成就，甚至可以向其他模組或主線遊戲中添加額外的成就。在這個初始版本中，已為教學戰役、<cite>墮入黑暗</cite>、<cite>東部入侵</cite>、<cite>自由</cite>以及多人地圖<cite>黑暗預測</cite>、<cite>迷霧之島</cite>、<cite>新土地</cite>和<cite>團隊生存</cite>實現了成就系統。

source: For distributing your add-ons, Wesnoth now allows using your forum username and password when uploading. When using this approach, the add-on’s passphrase is instead stored in the encrypted credentials file rather than plaintext in your <code>_server.pbl</code>, which is more secure, but it also means that if you lose your password you can use the forum’s password recovery to regain access to your add-ons. Additionally, this allows specifying other users who are allowed to upload updates to the add-on, for add-ons which are developed collaboratively by multiple people. Your <code>_server.pbl</code> will also be validated prior to uploading your add-on, so you will know of any issues before the upload takes place rather than afterwards.
ja: あなたがアドオンを配布する際に、Wesnothはあなたのフォーラムでのユーザー名とパスワードをアップロードに使用できるようになりました。この方法を使用すると、<code>_server.pbl</code>内のプレーンテキストのかわりに暗号化された証明書ファイルとしてアドオンのパスフレーズを格納できるようになります。これによって安全性が増し、もしあなたがパスワードを失ってしまってもフォーラムのパスワードを使用して再びあなたのアドオンにアクセスできるようになります。さらに、複数人で協力して開発を行っている場合は、あなたの他にもアドオンをアップロードできるユーザーを指定できるようになります。また、あなたの<code>_server.pbl</code>はアドオンのアップロード前に検証されるようになったため、事前に問題に気付くことができるようになりました。
uk: Для поширення ваших аддонів/модів Веснот тепер дозволяє використовувати ваше ім'я користувача та пароль на форумі під час завантаження. Використовуючи цей підхід, кодова фраза аддону зберігається у зашифрованому файлі облікових даних, а не у текстовому форматі у вашому <code>_server.pbl</code>, що є більш безпечним, проте це також означає, що якщо ви забудете свій пароль, ви зможете використовувати функцію відновлення пароля на форумі, щоб отримати доступ до своїх аддонів/модів. Ще це дозволяє вказати інших користувачів, яким дозволено завантажувати оновлення аддонів/модів, що розробляються спільно декількома людьми. Ваш файл <code>_server.pbl</code> також буде перевірено перед завантаженням вашого додатка, тому ви будете знати про будь-які проблеми перед завантаженням, а не після цього.
zh_tw: 關於您自製模組的發佈，韋諾之戰現在允許使用您的論壇使用者名稱和密碼來上傳模組。這樣一來，模組的密碼將儲存在加密文件中，而不是以純文本形式儲存在您的<code>_server.pbl</code>中，這將更具更安全性，但也意味者，如果您忘記密碼，必須要使用論壇的密碼恢復功能來重新取得存取許可。此外，對於多人合作開發的模組，可以讓被指定的用戶對該模組進行更新。在上傳模組前，必須先驗證您的<code>_server.pbl</code>，就能在上傳前就知道是否存在任何問題，而不是之後才發現。

source: Raise/lowered terrain
ja: 地形の上昇・下降
uk: Підвищена/заглиблена місцевість
zh_tw: 高低地形

source: The scenario editor has received a major upgrade: instead of only being able to understand single scenario files, it is now capable of creating the skeleton of a brand new add-on as well as providing a UI for creating the required <code>_server.pbl</code>. This means it’s now possible to create an add-on, the add-on’s <code>_server.pbl</code>, its scenarios, and upload the add-on for others to play, all from within Wesnoth.
ja: シナリオエディタがメジャーアップグレードしました。従来は単一のシナリオファイルの作成しかできませんでしたが、全く新しいアドオンを骨組みから作成し、必要な _server.pbl を作成するためのUIを提供することが可能になりました。つまり、アドオンやアドオンの _server.pbl やシナリオの作成と、アドオンサーバーへアップロードすることのすべてが、Wesnoth 本体だけで可能になったということです。
uk: Редактор сценаріїв отримав значне оновлення: тепер, замість того, щоб розрізняти лише окремі файли сценаріїв, він здатен створювати каркас нового аддону/моду, а також надає користувальницький інтерфейс для створення необхідного файлу <code>_server.pbl</code>. Це означає, що тепер можливо створити аддон/мод, файл <code>_server.pbl</code>, сценарії та завантажити аддон для інших гравців, не покидаючи Весноту.
zh_tw: 章節編輯器進行重大升級：現在不僅能理解單一章節，還可以讓您製作新模組的結構，也提供在製作<code>_server.pbl</code>時的使用者介面。這意味著現在您可以在韋諾之戰裡製作一個模組、該模組的<code>_server.pbl</code>及該模組的劇情，並上傳該模組供其他玩家使用。

source: The map editor similarly has been given a significant improvement: it’s now possible to add cliffs and valleys, which can be used to add quite a bit of <cite>depth</cite> to your maps. Beyond that, there’s been a variety of new terrains and fauna units added from palisade walls, seashell embellishments, and seaweed terrain to fire ants, giant jumping spiders, and rocs.
ja: マップエディタも大幅に改善されました。断崖（cliff）や渓谷（valley）を追加できるようになったことで、マップに奥行き感を出せるようになりました。それ以外にも、多くの地形と動物ユニット ― 絶壁や貝の装飾、海藻地形に始まり、火蟻や巨大跳び蜘蛛、ロック鳥まで、多様なアイテムが追加されました。
uk: Редактор мап також отримав значне покращення: тепер можливо додавати скелі та долини, що дозволить додати трохи <cite>глибини</cite> вашим мапам. Крім того, було додано різноманіття нової місцевості та бійців фауни, включаючи палісадні стіни, прикраси з черепашок і морські водорості, а також вогняних мурах, гігантських стрибаючих павуків та птахів рух.
zh_tw: 地圖編輯器也得到重大改進：現在可以加入懸崖和山谷，為您的地圖增加不少的<cite>細節</cite>。除此之外，還能新增各種新的地形和生物，從柵欄牆、貝殼裝飾和海藻地形到火蟻、巨型跳蛛和巨鷹都有。

source: A wide variety of units have likewise had their sprites improved and had various animations added, primarily Loyalists, Orcs, and Trolls but also some Elf and Undead units.
ja: 忠誠ユニットを始め、オークやトロル、エルフ、アンデッドにいたる様々なユニットのスプライト画像が改善され、多様なアニメーションも追加されました。
uk: Велика кількість бійців отримала покращені спрайти та було додано багато анімацій, переважно для Вірнопідданих, Орків та Тролів, а також кількох Ельфів та Мерців.
zh_tw: 許多精靈單位的圖像得到改善，並新增各種動畫，主要是保皇派、半獸人和巨魔，但也包括一些精靈和不死族的單位。

source: And finally, LuaCATS documentation has been added for nearly all of the Lua functions that Wesnoth defines, providing autocomplete when typing and documentation when hovering over the function. This was written primarily for Visual Studio Code, but should work with any editor that has an LuaCATS plugin.
ja: そして遂に、Wesnoth が定義しているほぼすべての Lua 関数に LuaCATS ドキュメンテーションが追加されて、入力時のオートコンプリートと、関数の上にカーソルをホバーさせたときのドキュメント表示が可能となりました。本来は Visual Studio Code 向けに作成されたものですが、LuaCATS プラグインがあるエディターならどれでも動作するはずです。
uk: І нарешті, для майже всіх Lua функцій, які використовує Веснот, була додана документація LuaCATS, яка забезпечує автодоповнення під час введення та допомогу при наведенні курсора на функцію. Це було розроблено в основному для Visual Studio Code, але має працювати з будь-яким редактором, який має плагін LuaCATS.
zh_tw: 最後，幾乎所有韋諾之戰定義的 Lua 函數現在都有 LuaCATS(Lua Comment And Type System) 支援，在輸入時會自動填寫，並在滑鼠停在上方時提供文檔。這主要是為了 Visual Studio Code 而編寫，但應適用於任何具有 LuaCATS 模組的編輯器。

source: Contribute
ja: 貢献
uk: Робіть свій внесок
zh_tw: 貢獻

source: <cite>The Battle for Wesnoth</cite> is constantly being improved and expanded upon by a multitude of international volunteers from diverse backgrounds. Since its inception in July 2003, hundreds of people have contributed to all areas of the game, from mainline content shipped as part of the official releases to hundreds of player-made projects available to download from our add-ons server. Whether you need help beating a particular scenario or adding a feature to your custom maps, <cite>Wesnoth</cite> boasts a massive community of players and creators always willing to help.
ja: <cite>The Battle for Wesnoth</cite> は世界各国の様々な得意分野を持つ人々の自発的な貢献によって発展を続けています。2003 年 7 月にプロジェクトが始まって以来、公式リリースに取り込まれたコンテンツはもちろん、アドオンサーバからダウンロード可能なユーザの独自プロジェクトまで、多くの人々が様々な形でプロジェクトに貢献してきました。シナリオがクリアできないとき、独自マップの作成で困ったときなど、<cite>Wesnoth</cite>の誇るこの巨大なコミュニティがきっとあなたの助けになってくれるでしょう。
uk: <cite>Битву за Веснот</cite> постійно покращує та розширює безліч інтернаціональних добровольців, що мають різний досвід та походять з різних країн. З самого початку Весноту в липні 2003 року, сотні людей зробили свій внесок в усі сфери гри, починаючи основним вмістом, що поставляється як частина офіційних випусків, і закінчуючи сотнями користувацьких проєктів, що доступні для завантаження з нашого серверу аддонів/модів. Незалежно від того, чи потрібна вам допомога в проходжені певного сценарію чи додаванні функцій до ваших власних карт, <cite>Веснот</cite> може похвалитися величезною спільнотою гравців і творців, які завжди готові допомогти.
zh_tw: 許多來自不同背景的國際志願者不間斷地對<cite>韋諾之戰</cite>進行改進和擴展。自 2003 年 7 月創立以來，數百人在遊戲的各個領域做出了貢獻，從官方發布的主要內容到數百個玩家製作的模組，都可以透過我們的模組伺服器來下載。無論您需要幫忙來打贏特定的章節，或是在您的自定地圖上添加某個功能，韋諾之戰都擁有一個龐大的玩家和創作者社區，隨時為您提供協助。

source: Besides creating your own add-on content, there are many other ways you can help <cite>Wesnoth</cite>:
ja: アドオンコンテンツの作成以外にも、<cite>Wesnoth</cite> の開発に貢献する方法はたくさんあります：
uk: Окрім створення власних аддонів та модів, існує багато інших способів допомогти <cite>Весноту</cite>:
zh_tw: 除了創作您自己的模組之外，還有其他許多方式可以讓<cite>韋諾</cite>變得更好：
