Repository: celerini/website
Catalog: start/1.18/po/*.po
Languages: ja, uk, zh_tw

source: <a href="https://wiki.wesnoth.org/Project">Contribute</a> code
ja: コードの<a href="https://wiki.wesnoth.org/Project">コントリビューション</a>
uk: <a href="https://wiki.wesnoth.org/Project">Робіть свій внесок</a> у код
zh_tw: <a href="https://wiki.wesnoth.org/Project">貢獻</a>編碼

source: <a href="https://forums.wesnoth.org/viewforum.php?f=9">Create</a> art for the main game or for user-made <a href="https://forums.wesnoth.org/viewforum.php?f=23">add-ons</a>
ja: <a href="https://forums.wesnoth.org/viewforum.php?f=9">メインゲーム</a>と<a href="https://forums.wesnoth.org/viewforum.php?f=23">アドオン</a>用のグラフィック制作
uk: <a href="https://forums.wesnoth.org/viewforum.php?f=9">Створюйте</a> ілюстрації для основної гри чи користувацьких <a href="https://forums.wesnoth.org/viewforum.php?f=23">аддонів та модів</a>
zh_tw: 為主遊戲<a href="https://forums.wesnoth.org/viewforum.php?f=9">製作</a>美術圖像或自製<a href="https://forums.wesnoth.org/viewforum.php?f=23">模組</a>

source: <a href="https://wiki.wesnoth.org/WesnothTranslations">Translate</a> the game into your language
ja: <a href="https://wiki.wesnoth.org/WesnothTranslations">翻訳</a>
uk: <a href="https://wiki.wesnoth.org/WesnothTranslations">Перекладайте</a> гру вашою мовою
zh_tw: <a href="https://wiki.wesnoth.org/WesnothTranslations">翻譯</a>遊戲成您的語言

source: <a href="https://forums.wesnoth.org/viewforum.php?f=14">Produce</a> new music tracks and sound effects
ja: ミュージックトラックとサウンドエフェクトの<a href="https://forums.wesnoth.org/viewforum.php?f=14">制作</a>
uk: <a href="https://forums.wesnoth.org/viewforum.php?f=14">Створюйте</a> новую музику та звукові ефекти
zh_tw: <a href="https://forums.wesnoth.org/viewforum.php?f=14">製作</a>新的音樂曲目和音效

source: Spread the word about <cite>Wesnoth</cite> on social media!
ja: ソーシャルメディア上で<cite>Wesnoth</cite>を広める！
uk: Поширюйте інформацію про <cite>Веснот</cite> в соціальних мережах!
zh_tw: 在社群媒體上宣傳<cite>韋諾之戰</cite>的訊息！

source: More Info
ja: 詳細
uk: Більше інформації
zh_tw: 更多資訊

source: <a href="https://changelog.wesnoth.org/1.18/">Full Changelog</a> (English only)
ja: <a href="https://changelog.wesnoth.org/1.18/">すべての変更履歴</a>（英語）
uk: <a href="https://changelog.wesnoth.org/1.18/">Повний список змін</a> (лише англійською)
zh_tw: <a href="https://changelog.wesnoth.org/1.18/">完整的更新日誌</a> (英文)

source: <a href="https://www.wesnoth.org/manual/1.18/manual.en.html">User’s Manual</a>
ja: <a href="https://www.wesnoth.org/manual/1.18/manual.ja.html">ユーザーマニュアル</a>
uk: <a href="https://www.wesnoth.org/manual/1.18/manual.en.html">Інструкція користувача</a>
zh_tw: <a href="https://www.wesnoth.org/manual/stable/manual.zh_TW.html">玩家手冊</a>

source: <a href="https://www.wesnoth.org">Official Website</a> (English only)
ja: <a href="https://www.wesnoth.org">公式サイト</a>（英語）
uk: <a href="https://www.wesnoth.org">Офіційний веб-сайт</a> (лише англійською)
zh_tw: <a href="https://www.wesnoth.org">官方網站</a> (英文)

source: <a href="https://www.wesnoth.org/start/1.16">Wesnoth 1.16 Release Notes</a>
ja: <a href="https://www.wesnoth.org/start/1.16">Wesnoth 1.16 リリースノート</a>
uk: <a href="https://www.wesnoth.org/start/1.16">Нотатки розробників до Wesnoth 1.16</a>
zh_tw: <a href="https://www.wesnoth.org/start/1.16">韋諾之戰 1.16 版本說明</a>

source: <a href="https://www.wesnoth.org/start/1.14">Wesnoth 1.14 Release Notes</a>
ja: <a href="https://www.wesnoth.org/start/1.14">Wesnoth 1.14 リリースノート</a>
uk: <a href="https://www.wesnoth.org/start/1.14">Нотатки розробників до Wesnoth 1.14</a>
zh_tw: <a href="https://www.wesnoth.org/start/1.14">韋諾之戰 1.14 版本說明</a>

source: <a href="https://www.wesnoth.org/start/1.12">Wesnoth 1.12 Release Notes</a>
ja: <a href="https://www.wesnoth.org/start/1.12">Wesnoth 1.12 リリースノート</a>
uk: <a href="https://www.wesnoth.org/start/1.12">Нотатки розробників до Wesnoth 1.12</a>
zh_tw: <a href="https://www.wesnoth.org/start/1.12">韋諾之戰 1.12 版本說明</a>

source: <a href="https://www.wesnoth.org/start/1.10">Wesnoth 1.10 Release Notes</a>
ja: <a href="https://www.wesnoth.org/start/1.10">Wesnoth 1.10 リリースノート</a>
uk: <a href="https://www.wesnoth.org/start/1.10">Нотатки розробників до Wesnoth 1.10</a>
zh_tw: <a href="https://www.wesnoth.org/start/1.10">韋諾之戰 1.10 版本說明</a>

source: This page is also available in the following languages:
ja: 利用可能な他の言語：
uk: Ця сторінка також доступна наступними мовами:
zh_tw: 此頁面還有其他語言版本：

source: <a href="https://wiki.wesnoth.org/StartingPoints">Site Map</a> &#8226; <a href="https://status.wesnoth.org/">Site Status</a>
ja: <a href="https://wiki.wesnoth.org/StartingPoints">サイトマップ</a> &#8226; <a href="https://status.wesnoth.org/">サイトステータス</a>
uk: <a href="https://wiki.wesnoth.org/StartingPoints">Мапа веб-сайту</a> &#8226; <a href="https://status.wesnoth.org/">Статус веб-сайту</a>
zh_tw: <a href="https://wiki.wesnoth.org/StartingPoints">網站導覽</a> &#8226; <a href="https://status.wesnoth.org/">伺服器狀態</a>

source: Copyright &#169; 2003&#8211;2024 by <a rel="author" href="https://wiki.wesnoth.org/Project">The Battle for Wesnoth Project</a>
zh_tw: 版權所有&#169; 2003&#8211;2024 <a rel="author" href="https://wiki.wesnoth.org/Project">韋諾之戰製作團隊</a>

source: Site design Copyright &#169; 2017&#8211;2024 by Iris Morelle
zh_tw: 網站設計版權所有&#169; 2017&#8211;2024 Iris Morelle
